List<MapEntry<String, String>> quranVirtueQuran = [
  const MapEntry(
      "الَّذِينَ آَتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ أُولَئِكَ يُؤْمِنُونَ بِهِ وَمَنْ يَكْفُرْ بِهِ فَأُولَئِكَ هُمُ الْخَاسِرُونَ",
      "سورة البقرة: 121"),
  const MapEntry(
      "وَإِذَا قُرِئَ الْقُرْآَنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ",
      "الأعراف: 204"),
  const MapEntry(
      "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آَيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ",
      "الأنفال: 2"),
  const MapEntry(
      "أَقِمِ الصَّلَاةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ وَقُرْآَنَ الْفَجْرِ إِنَّ قُرْآَنَ الْفَجْرِ كَانَ مَشْهُودًا * وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا",
      "الإسراء: 78، 79"),
  const MapEntry(
      "إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَنْ تَبُورَ",
      "فاطر: 29"),
  const MapEntry(
      "اللَّهُ نزلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُتَشَابِهًا مَثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَى ذِكْرِ اللَّهِ ذَلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "الزمر: 23"),
  const MapEntry("وَلَقَدْ يَسَّرْنَا الْقُرْءَانَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ", "القمر: 17"),
  const MapEntry(
      "شَهْرُ رَمَضَانَ الَّذِي أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ",
      "البقرة:186"),
];
List<MapEntry<String, String>> quranVirtueAhadeeth = [
  const MapEntry(
      "اقْرَؤُوا الزَّهْراوَينِ: البَقَرةَ وآلَ عِمرانَ؛ فإنَّهما يأتيانِ يَومَ القيامةِ كأنَّهما غَمامَتانِ أو غَيايَتانِ أو فِرقانِ من طَيرٍ صَوافَّ تُحاجَّانِ عن صاحِبِهما",
      "رواه مسلم"),
  const MapEntry(
      "تعاهدوا هَذَا القُرْآنَ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَهُوَ أشَدُّ تَفَلُّتاً مِنَ الإبلِ فِي عُقُلِهَا",
      "متفق عليه"),
  const MapEntry(
      "اقْرَؤُوا سُورَةَ البَقَرَةِ، فإنَّ أخْذَها بَرَكَةٌ، وتَرْكَها حَسْرَةٌ، ولا تَسْتَطِيعُها البَطَلَةُ.",
      "رواه مسلم \n  قالَ مُعاوِيَةُ: بَلَغَنِي أنَّ البَطَلَةَ: السَّحَرَةُ."),
  const MapEntry("خَيْرُكُمْ مَن تَعَلَّمَ القُرْآنَ وعَلَّمَهُ.", "رواه البخاري"),
  const MapEntry(
      "يُقالُ لصاحِبِ القرآنِ اقرأ وارتَقِ ورتِّل كما كنتَ ترتِّلُ في الدُّنيا فإنَّ منزلَكَ عندَ آخرِ آيةٍ تقرؤُها",
      "رواه ابي داوود والترمذي"),
  const MapEntry(
      "الذي يَقرَأُ القُرآنَ وهو ماهِرٌ به مع السَّفَرةِ الكِرامِ البَرَرةِ، والذي يَقرَؤُه وهو يَشتَدُّ عليه فله أجْرانِ.",
      "متفق عليه"),
  const MapEntry(
      "مثلُ المؤمنِ الَّذي يقرأُ القرآنَ كالأُتْرُجَّةِ طعمُها طيِّبٌ وريحُها طيِّبٌ والَّذي لا يقرأُ كالتَّمرةِ طعمُها طيِّبٌ ولا ريحَ لها ومثلُ الفاجرِ الَّذي يقرأُ القرآنَ كالرَّيْحانةِ ريحُها طيِّبٌ وطعمُها مُرٌّ ومثلُ الفاجرِ الَّذي لا يقرأُ القرآنَ كمثلِ الحنظلةِ طعمُها مرٌّ وريحُها مرٌّ",
      "متفق عليه \n الأترجة : نبات من فصيلة البرتقاليات"),
  const MapEntry(
      "إنَّ اللَّهَ يَرْفَعُ بهذا الكِتَابِ أَقْوَامًا، وَيَضَعُ به آخَرِينَ", "متفق عليه"),
  const MapEntry(
      "لَا تَحَاسُدَ إِلَّا في اثْنَتَيْنِ: رَجُلٌ آتَاهُ اللَّهُ القُرْآنَ، فَهو يَتْلُوهُ آنَاءَ اللَّيْلِ وَالنَّهَارِ، يقولُ: لو أُوتِيتُ مِثْلَ ما أُوتِيَ هذا لَفَعَلْتُ كما يَفْعَلُ، وَرَجُلٌ آتَاهُ اللَّهُ مَالًا يُنْفِقُهُ في حَقِّهِ فيَقولُ: لو أُوتِيتُ مِثْلَ ما أُوتِيَ لَفَعَلْتُ كما يَفْعَلُ.",
      "رواه البخاري \n آناء : ساعات"),
  const MapEntry(
      "كانَ رَجُلٌ يَقْرَأُ سُورَةَ الكَهْفِ، وإلَى جانِبِهِ حِصانٌ مَرْبُوطٌ بشَطَنَيْنِ، فَتَغَشَّتْهُ سَحابَةٌ، فَجَعَلَتْ تَدْنُو وتَدْنُو وجَعَلَ فَرَسُهُ يَنْفِرُ، فَلَمَّا أصْبَحَ أتَى النبيَّ صَلَّى اللهُ عليه وسلَّمَ فَذَكَرَ ذلكَ له فقالَ: تِلكَ السَّكِينَةُ تَنَزَّلَتْ بالقُرْآنِ.",
      "متفق عليه \n الشطن هو الحبل الطويل"),
  const MapEntry(
      "من قرأ حرفًا من كتابِ اللهِ فله به حسنةٌ، والحسنةُ بعشرِ أمثالِها لا أقولُ (الـم) حرفٌ ولكنْ (ألفٌ) حرفٌ و(لامٌ) حرفٌ و(ميمٌ) حرفٌ",
      "رواه الترمذي"),
  const MapEntry(
      "اقْرَؤُوا القُرْآنَ فإنَّه يَأْتي يَومَ القِيامَةِ شَفِيعًا لأَصْحابِهِ", "رواه مسلم"),
];
